# Code Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..Code Property
FabricationServiceButton Class See Also
---
The code of the button.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string Code { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Code As String
	Get
```

Visual C++
---
```text
public:
property String^ Code {
	String^ get ();
}
```

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace